# -*- coding: utf-8 -*-
"""
Created on Fri Apr 30 11:15:01 2021

@author: hp
"""
'''
key={ 1: ('校门')
           }
print(key[1])
'''

def chara_turn_num(a,b,key):
    z=0
    x=0
    for i in key:
        if str(a) in key[i]:
            z=i
        if str(b) in key[i]:
            x=i
   # print(z,x)
    return z,x
   # print(c,d)
    
if __name__=='__main__':
    key={      
           
           32: ('体育场'),
           33: ('学生宿舍A组'),
           101: ('自动化学院主入口'),
            118:('电控中心（J5）'),
            125:('机电学院主入口'),
            135:('光电学院主入口（未在图片中）'),
            149:('教学楼（信管）（J8）'),
            153:('教学楼（经管）（J10）'),
            157:('教学楼（计算机）（J11）'),
            158:('教学楼（通信）（J9）'),
            164:('图书信息与教育中心主入口2'),
            168:('图书信息与教育中心货口'),
            170:('图书信息与教育中心主入口1'),
            180:('基础教学楼主入口J1'),
            184:('人文学院主入口J2'),
            188:('理学院主入口J3'),
            195:('人文学院主入口(J2)'),
            198:('人文学院入口(J2)'),
            199:('基础教学楼(J1)'),
            201:('学一食堂(H1)主入口2'),
            202:('学一食堂(H2)主入口'),
            204:('学一食堂（H1）主入口1'),
            206:('学一食堂(H1)货口'),
            212:('学一食堂(H2)'),
            217:('学生宿舍A楼'),
            229:('食堂h3'),
            231:('学生科技活动创新教育中心'),
            233:('风雨操场与后勤保障中心'),
            243:('产业研发大楼（远期）'),
            244:('国际交流中心'),
            246:('综合教学楼（远期）'),
            252:('主行政楼'),
            253:('科研与实验楼3'),
            256:('预留教学实验用地'),
            257:('学生三食堂'),
            260:('学生宿舍（远期）s14'),
            263:('研究生宿舍/倒班宿舍（远期）s13'),
            264:('后勤服务楼（远期）h13'),
            267:('留学生宿舍s12'),
            269:('工程训练车辆中心'),
            270:('工程训练中心车间'),
            273:('研究生宿舍/留学生宿舍s11'),
            276:('篮球场1'),
            278:('后勤设施用房、收发室'),
            279:('足球场1'),
            281:('燃气调压站'),
            284:('锅炉房'),
            286:('网球场')
            }
    a=input('起点：')
    b=input('终点：')
    z,x=chara_turn_num(a,b,key)
    
   # print(key[i])

'''
print(value['']
a=input("起点")
b=input("终点")
for i in range(len(key)):
    if str(a)==key[a]:
        c=a
        d=b
print(c)
print(d)
'''